# Pandas Examples

In [2]:
import pandas as pd
import numpy as np

## Introduction

DataFrame
: A 2D array with column labels and heterogenous elements (possibly missing data). All the elements in a column must be homogenous.

Series
: A 1D array with homogenous elements (possibly missing data).

Index
: Each row in a DataFrame has an index. This is a hidden attribute(s) that is like the row's label.

## Series

* The default index is of type integer, where the index of the first row is 0, the index of the second row is 1, and so on.

* The elements in a series must be of same type.

In [3]:
data = pd.Series(np.arange(5) + 5)
print(data)

0    5
1    6
2    7
3    8
4    9
dtype: int32

### Accessing a Series

* Efficient access is supported on the index field (there's a hashtable on the index attribute(s)).

* Indices should usually be on unique fields.

* Can change the index of series/dataframe whenever.

In [4]:
print(data.loc[0],'\n')
print(data.loc[:2],'\n')
print(data.index,'\n')
print(data.index.values)

5

0    5
1    6
2    7
dtype: int32

RangeIndex(start=0, stop=5, step=1)

[0 1 2 3 4]

### Using Custom Index

* `iloc` uses the order of the rows (normal zero-indexing).

* If a range is specified, the last value is not returned (like normal python range).

* `loc` uses the defined index.

* If a range is specified, the last value **is** returned.

In [5]:
data = pd.Series(np.arange(5) + 5, index=['a','b','c','d','e'])
print(data, data.loc['a'], data.iloc[0], data.loc['a':'c'],sep='\n\n')

a    5
b    6
c    7
d    8
e    9
dtype: int32

5

5

a    5
b    6
c    7
dtype: int32

### Transforming a Python Dictionary into a Series

In [6]:
population = {'California':38332521,'Texas':26448193,'New York':19651127}
mySeries = pd.Series(population)
print(mySeries,'\n')
print(mySeries.loc['California':'Texas'])

California    38332521
Texas         26448193
New York      19651127
dtype: int64

California    38332521
Texas         26448193
dtype: int64

## DataFrame

In [7]:
population = {'California':38332521,'Texas':26448193,'New York':19651127}
area = {'California':423967,'Texas':695662,'New York':141297}
states = pd.DataFrame({'population':population,'area':area})
display(states) # Use display instead of print to have cleaner output

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297

### Querying Rows and Columns

In [8]:
display(states['area'])# returns a Series
display(states.loc['California'])
display(states.loc['California']['area'])
display(states.iloc[1])

California    423967
Texas         695662
New York      141297
Name: area, dtype: int64

population    38332521
area            423967
Name: California, dtype: int64

423967

population    26448193
area            695662
Name: Texas, dtype: int64

### Creating a DataFrame

From 2D array:

In [9]:
pd.DataFrame([[1,2,3],[3,4,5]], columns=['A','B','C'],index=['1','2'])

   A  B  C
1  1  2  3
2  3  4  5

From an array of python dictionaries:

In [10]:
pd.DataFrame([{'a':1,'b':2},{'b':3,'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

### Creating a DataFrame with Hierachical Columns

In [11]:
d = {('a','b'):[1,2,3,4], ('a','c'):[5,6,7,8]}
df = pd.DataFrame(d, index=['r1','r2','r3','r4'])
df.columns.names = ('level 0','level 1')
display(df[('a','b')]) # everything for column a,b
display(df['a']) # info for both columns

r1    1
r2    2
r3    3
r4    4
Name: (a, b), dtype: int64

level 1  b  c
r1       1  5
r2       2  6
r3       3  7
r4       4  8

### Creating a new Column

In [12]:
states['density'] = states['population'] / states['area']
display(states)

            population    area     density
California    38332521  423967   90.413926
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746

Useful ways to access a DataFrame

a
: np array of the values in the DataFrame

b
: Only the first 2 rows and first 2 columns of the DataFrame

c
: All rows above and including New York, all columns to the left and including population

In [13]:
a = states.values
b = states.iloc[:2,:2]
c = states.loc[:'New York',:'population']

display(a)
display(b)
display(c)

array([[3.83325210e+07, 4.23967000e+05, 9.04139261e+01],
       [2.64481930e+07, 6.95662000e+05, 3.80187404e+01],
       [1.96511270e+07, 1.41297000e+05, 1.39076746e+02]])

            population    area
California    38332521  423967
Texas         26448193  695662

            population
California    38332521
Texas         26448193
New York      19651127

### Selection and Projection

In [14]:
display(states[states['density'] > 50]) # selection
display(states[['area','population']]) # projection
display(states[states['density'] > 50][['area','population']]) # both

            population    area     density
California    38332521  423967   90.413926
New York      19651127  141297  139.076746

              area  population
California  423967    38332521
Texas       695662    26448193
New York    141297    19651127

              area  population
California  423967    38332521
New York    141297    19651127

### Operations on DataFrames

x
: Add matching elements of A and B, NaN values if there's discrepencies

y
: Add matching elements of A and B, fill discrepencies with 0

z
: Add matching elements of A and B, fill discrepencies with the average of all elements in A

In [15]:
A = pd.DataFrame([[2,4],[3,4]], columns=['A','B'],index=['1','2'])
B = pd.DataFrame([[1,2,3],[3,4,5]], columns=['A','B','C'],index=['1','2'])
x = A+B
y = A.add(B,fill_value=0)
z = A.add(B,fill_value=A.stack().mean())

display(x)
display(y)
display(z)

   A  B   C
1  3  6 NaN
2  6  8 NaN

   A  B    C
1  3  6  3.0
2  6  8  5.0

   A  B     C
1  3  6  6.25
2  6  8  8.25

The `stack` method creates a Series from a DataFrame. Each value in the initial DataFrame appears in a new row. The index is a MultiIndex (index of more than one fields) that contains the row/column combos of the DataFrame labels.

In [16]:
display(B)
B.stack()

   A  B  C
1  1  2  3
2  3  4  5

1  A    1
   B    2
   C    3
2  A    3
   B    4
   C    5
dtype: int64

### Broadcasting

In [17]:
X = pd.DataFrame([[1,2],[3,4]], columns=['A','B'], index=['1','2'])
display(X - X.iloc[0]) # X.iloc[0] is broadcasted to a 2x2 df
display(X.describe())

   A  B
1  0  0
2  2  2

              A         B
count  2.000000  2.000000
mean   2.000000  3.000000
std    1.414214  1.414214
min    1.000000  2.000000
25%    1.500000  2.500000
50%    2.000000  3.000000
75%    2.500000  3.500000
max    3.000000  4.000000

## Using NaN

Use `np.nan` to specify a missing value

In [18]:
data = pd.Series([1,np.nan,'hello',np.nan])
display(data.isnull())
display(data[data.notnull()])
display(data.dropna()) # drop nan rows

0    False
1     True
2    False
3     True
dtype: bool

0        1
2    hello
dtype: object

0        1
2    hello
dtype: object

a
: Drop all columns with a NaN value

b
: Keep all rows with at least 2 non NaN values

c
: Drop all columns with all NaN values

In [19]:
data = pd.DataFrame([[1,np.nan,2,np.nan],[2,3,5,np.nan],[np.nan,4,6,np.nan]])
a = data.dropna(axis='columns')
b = data.dropna(thresh=2)
c = data.dropna(axis='columns',how='all')

display(data)
display(a)
display(b)
display(c)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

   2
0  2
1  5
2  6

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

### Filling NaN Values

a
: Fills NaN with 0

b
: Forward fill (value above)

c
: Backward fill (value below)

d
: Forward fill, but use columns (value to the left)

In [20]:
data = pd.DataFrame([[1,np.nan,2],[2,3,5],[np.nan,4,6]])
a = data.fillna(0)
b = data.fillna(method='ffill')
c = data.fillna(method='bfill')
d = data.fillna(method='ffill',axis='columns')

display(data)
display(a)
display(b)
display(c)
display(d)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

     0    1  2
0  1.0  0.0  2
1  2.0  3.0  5
2  0.0  4.0  6

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  2.0  4.0  6

     0    1  2
0  1.0  3.0  2
1  2.0  3.0  5
2  NaN  4.0  6

     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0

## Index Functions

* `data.index`: shows the index
* `data.columns`: shows the columns
* `data.values`: shows the data
* `data.set_index(['a','b'])`: moves columns *a* and *b* and makes them the index attributes

### MultiIndex

* An index with multiple attributes
* For example, `state` and `year`. For each state, we have info about every year, and the population for that year.
* The index would be `(state,year)`
* Allows searching by both state and year
* Unstacking makes the years become the columns and state become rows
* This can be undone by stacking the unstacked DataFrame

In [21]:
index = [('California',2000),('California',2010),('New York', 2000),('New York',2010),('Texas',2000),('Texas',2010)]
populations = [33871648,37253956,18976457,19378102,20851820,25145561]
pop = pd.Series(populations, index=index)
display(pop)
index = pd.MultiIndex.from_tuples(index)
pop = pop.reindex(index)

display(pop)
display(pop.unstack())

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

Same as above but using dictionary

In [22]:
data = {('California',2000):33871648,
        ('California',2010):37253956,
        ('New York', 2000):18976457,
        ('New York',2010):19378102,
        ('Texas',2000):20851820,
        ('Texas',2010):25145561}
pop = pd.Series(data)

display(pop)
display(pop.unstack())

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

### Querying with MultiIndex

In [23]:
display(pop.loc['California'])
display(pop.loc[:,2010])
display(pop[pop > 20000000])
display(pop.loc[['California','Texas']])

2000    33871648
2010    37253956
dtype: int64

California    37253956
New York      19378102
Texas         25145561
dtype: int64

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

### Creating a MultiIndex

Notice how indices *a*, *b*, and *c* all reindex to the same result as the intial DataFrame

In [24]:
df1 = pd.DataFrame(np.random.rand(4,2),index=[['a','a','b','b'],[1,2,1,2]],columns=['d1','d2'])
index1 = pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])
index2 = pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)])
index3 = pd.MultiIndex.from_product([['a','b'],[1,2]])
a = df1.reindex(index1)
b = df1.reindex(index2)
c = df1.reindex(index3)

display(df1)
display(a)
display(b)
display(c)

           d1        d2
a 1  0.484625  0.172990
  2  0.122419  0.541096
b 1  0.158196  0.526046
  2  0.059117  0.205275

           d1        d2
a 1  0.484625  0.172990
  2  0.122419  0.541096
b 1  0.158196  0.526046
  2  0.059117  0.205275

           d1        d2
a 1  0.484625  0.172990
  2  0.122419  0.541096
b 1  0.158196  0.526046
  2  0.059117  0.205275

           d1        d2
a 1  0.484625  0.172990
  2  0.122419  0.541096
b 1  0.158196  0.526046
  2  0.059117  0.205275

### Sorting an Index

* By default, index does not need to be sorted
* Use `data.sort_index()` to sort the data based on the index
* In the example below, row *d* gets moved into the proper alphabetical place after sort

In [25]:
index = pd.Index(['a','d','b','c'])
p = pd.DataFrame(np.random.rand(4,4), index=index)
display(p)
p = p.sort_index()
display(p)

          0         1         2         3
a  0.192589  0.962547  0.479936  0.193103
d  0.463886  0.853977  0.737701  0.517800
b  0.479041  0.590359  0.050243  0.529031
c  0.577069  0.633124  0.142120  0.192260

          0         1         2         3
a  0.192589  0.962547  0.479936  0.193103
b  0.479041  0.590359  0.050243  0.529031
c  0.577069  0.633124  0.142120  0.192260
d  0.463886  0.853977  0.737701  0.517800

### Index Setting and Resetting

In [26]:
pop.index.names = ['state', 'year'] # Names the index columns
display(pop)
pop_flat = pop.reset_index(name='population') # Names the value (population) column
display(pop_flat)
display(pop_flat.set_index(['state']))

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

            year  population
state
California  2000    33871648
California  2010    37253956
New York    2000    18976457
New York    2010    19378102
Texas       2000    20851820
Texas       2010    25145561

### Data Aggregation with MultiIndex
* Aggregation function are `min`,`max`,`sum`,`count`, `mean`, `first`, `last`, `std`, `var`, `product`, and `mad` (mean absolution deviation)
* Consider the MultiIndex for state and year

In [27]:
display(pop.count(level=0)) # per state
display(pop.sum(level=1)) # sum of all states in each year

state
California    2
New York      2
Texas         2
dtype: int64

year
2000    73699925
2010    81777619
dtype: int64

## Concatenating DataFrames

Non unique indices mean they just stack on top of each other

In [28]:
df1 = pd.DataFrame({'a':['a1','b0'],'b':['b0','b1']},index=[0,1])
df2 = pd.DataFrame({'a':['a1','b0'],'b':['b0','b1']},index=[0,1])
display(df1)
display(df2)
display(pd.concat([df1,df2])) # Index field is not unique
display(pd.concat([df1,df2],ignore_index=True)) # Index field is unique

    a   b
0  a1  b0
1  b0  b1

    a   b
0  a1  b0
1  b0  b1

    a   b
0  a1  b0
1  b0  b1
0  a1  b0
1  b0  b1

    a   b
0  a1  b0
1  b0  b1
2  a1  b0
3  b0  b1

### Creating a MultiIndex DataFrame with `concat`

The MultiIndex helps better label the concatenation of these DataFrames

Using the `df1` and `df2` from above:

In [29]:
result = pd.concat([df1,df2],keys=['df1','df2'])
result.index.names = ['type','idx']
display(result)

           a   b
type idx
df1  0    a1  b0
     1    b0  b1
df2  0    a1  b0
     1    b0  b1

### Types of Concatenation

* Outer: Include indices that don't overlap (NaN values fill in)
* Inner: Only have indices that overlap

In [30]:
df1 = pd.DataFrame({'a':['a1','a2'],'b':['b1','b2'],'c':['c1','c2']})
df2 = pd.DataFrame({'b':['b3','b4'],'c':['c3','c4'],'d':['d1','d2']})
display(pd.concat([df1,df2]))
display(pd.concat([df1,df2],join='inner'))

     a   b   c    d
0   a1  b1  c1  NaN
1   a2  b2  c2  NaN
0  NaN  b3  c3   d1
1  NaN  b4  c4   d2

    b   c
0  b1  c1
1  b2  c2
0  b3  c3
1  b4  c4

### Joining DataFrames (`merge` operator)

*** Notice the small differences in DataFrame construction for each coded cell

In [31]:
df1 = pd.DataFrame({'a':['a1','a2'],'b':['b1','b2'],'c':['c1','c2']})
df2 = pd.DataFrame({'b':['b1','b2'],'c':['c1','c2'],'d':['d1','d2']})
display(df1,df2)
display(pd.merge(df1,df2,on=['b','c']))

    a   b   c
0  a1  b1  c1
1  a2  b2  c2

    b   c   d
0  b1  c1  d1
1  b2  c2  d2

    a   b   c   d
0  a1  b1  c1  d1
1  a2  b2  c2  d2

Join 2 columns with the same elements but different names, then drop the repeat columns

In [32]:
df1 = pd.DataFrame({'a1':['a1','a2'],'b1':['b1','b2'],'c1':['c1','c2']})
df2 = pd.DataFrame({'b2':['b1','b2'],'c2':['c1','c2'],'d2':['d1','d2']})
display(pd.merge(df1,df2,left_on=['b1','c1'],right_on=['b2','c2']).drop(['b2','c2'],axis=1)) # axis=1 means delete col, 0 delete row

   a1  b1  c1  d2
0  a1  b1  c1  d1
1  a2  b2  c2  d2

### Joining on the Index

Performs an inner join between 2 DataFrames on the index attributes

In [33]:
df1 = pd.DataFrame({'a1':['a1','a2'],'b1':['b1','b2'],'c1':['c1','c2']})
df2 = pd.DataFrame({'b1':['b1','b3'],'c1':['c1','c2'],'d2':['d1','d2']})
df1 = df1.set_index(['b1','c1'])
df2 = df2.set_index(['b1','c1'])
display(pd.merge(df1,df2,left_index=True,right_index=True))

       a1  d2
b1 c1
b1 c1  a1  d1

Using only one index

In [34]:
df1 = pd.DataFrame({'a1':['a1','a2'],'b1':['b1','b2'],'c1':['c1','c2']})
df2 = pd.DataFrame({'b2':['b1','b3'],'c2':['c1','c2'],'d2':['d1','d2']})
df1 = df1.set_index(['b1','c1'])
display(pd.merge(df1,df2,left_index=True,right_on=['b2','c2']))

   a1  b2  c2  d2
0  a1  b1  c1  d1

### Outer Joins

In [35]:
df1 = pd.DataFrame({'name':['Peter','Paul','Mary'],'food':['fish','beans','bread']})
df2 = pd.DataFrame({'name':['Mary','Joseph'],'drink':['soda','juice']})
display(df1,df2)
display(df1.merge(df2,how='outer'))
display(df1.merge(df2,how='left'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name  drink
0    Mary   soda
1  Joseph  juice

     name   food  drink
0   Peter   fish    NaN
1    Paul  beans    NaN
2    Mary  bread   soda
3  Joseph    NaN  juice

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  soda

### Resolving Conflicts

Now the drink column from before is relabeled to food

In [36]:
df1 = pd.DataFrame({'name':['Peter','Paul','Mary'],'food':['fish','beans','bread']})
df2 = pd.DataFrame({'name':['Mary','Joseph'],'food':['soda','juice']})
display(df1.merge(df2,how='left',suffixes=['_L','_R'],on='name'))

    name food_L food_R
0  Peter   fish    NaN
1   Paul  beans    NaN
2   Mary  bread   soda

## Sorting

* Adding `inplace=True` will sort the DataFrame instead of producing a new one
* Adding `ascending=False` will reverse sorting order

In [37]:
df1 = pd.DataFrame({'name':['Peter','Paul','Mary','Mary'],'food':['fish','beans','bread','fish']})
display(df1.sort_values(by=['name','food']))
display(df1.sort_values(by=['name','food'],ascending=[True,False]))

    name   food
2   Mary  bread
3   Mary   fish
1   Paul  beans
0  Peter   fish

    name   food
3   Mary   fish
2   Mary  bread
1   Paul  beans
0  Peter   fish

## Duplication Elimination

In [38]:
df1 = pd.DataFrame({'name':['Peter','Paul','Mary'],'food':['fish','beans','soda']})
df2 = pd.DataFrame({'name':['Mary','Joseph'],'food':['soda','juice']})
display(pd.concat([df1,df2]))
display(pd.concat([df1,df2]).drop_duplicates())

     name   food
0   Peter   fish
1    Paul  beans
2    Mary   soda
0    Mary   soda
1  Joseph  juice

     name   food
0   Peter   fish
1    Paul  beans
2    Mary   soda
1  Joseph  juice

## Groupby

Just like in SQL, `groupby` allows the use of aggregation functions

In [39]:
df1 = pd.DataFrame({'name':['Peter','Paul','Mary'],'food':['fish','beans','soda']})
df2 = pd.DataFrame({'name':['Mary','Joseph'],'food':['soda','juice']})
display(pd.concat([df1,df2]).groupby('food').count())

       name
food
beans     1
fish      1
juice     1
soda      2

In [40]:
df = pd.DataFrame({'name':['Peter','Paul','Mary'],'department':['CS','ENG','CS'],'salary':[10,5,3]})
display(df.groupby('department')['salary'].describe())
df = pd.DataFrame({'name':['Peter','Paul','Mary'],'department':['CS','ENG','CS'],'salary':[10,5,3]})
s1 = df.groupby('department')['salary'].median() # Result is a Series
df2 = pd.DataFrame(s1)
df2.columns = ['avgsalary']
display(df2)

            count  mean       std  min   25%  50%   75%   max
department
CS            2.0   6.5  4.949747  3.0  4.75  6.5  8.25  10.0
ENG           1.0   5.0       NaN  5.0  5.00  5.0  5.00   5.0

            avgsalary
department
CS                6.5
ENG               5.0

### Aggregation

The `aggregate` method takes as input an array of functions, applying each function on each attribute

In [41]:
df = pd.DataFrame({'name':['Peter','Paul','Mary'],'department':['CS','ENG','CS'],'salary':[10,5,3],'age':[20,30,40]})
display(df.groupby('department').aggregate([min,max,np.median])) # Name isn't included since it's strings

           salary            age
              min max median min max median
department
CS              3  10    6.5  20  40     30
ENG             5   5    5.0  30  30     30

Note: `df['salary']['min']` == `df[('salary','min')]`

### Aggregation with a Custom Function

In the custom function, we take all the data in a single column and return a single value

In [42]:
def customFunc(df):
    return sum(df) + 1

a = pd.DataFrame([[1,2,3],[1,20,5],[3,4,5]], columns=['a','b','c'])
display(a)
display(a.groupby('a').aggregate(customFunc).rename(columns={'b':'my func b','c':'my func c'}))

   a   b  c
0  1   2  3
1  1  20  5
2  3   4  5

   my func b  my func c
a
1         23          9
3          5          6

### Filtering without Groupby

Use `query` method

In [43]:
df = pd.DataFrame({'name':['Peter','Paul','Mary'],'department':['CS','ENG','CS'],'salary':[10,5,3],'age':[20,30,40]})
display(df.query('salary > 4 and age < 30'))

    name department  salary  age
0  Peter         CS      10   20

### Filtering After Groupby

* Use `filter` after `groupby`
* However, it returns a subset of the rows in the oringinal DataFrames
* All the elements of each group that pass the filtering condition are returned

In [44]:
display(df.groupby('department').filter(lambda x: x['salary'].mean() > 5))
display(df.groupby('department').filter(lambda x: x['age'].count() > 1))

    name department  salary  age
0  Peter         CS      10   20
2   Mary         CS       3   40

    name department  salary  age
0  Peter         CS      10   20
2   Mary         CS       3   40

### Transformations Without Groupby

It applies a function on each row of a DataFrame

In [45]:
display(df['age'].transform(lambda x: x - 3))
display(df['age'] - 3) # same result

0    17
1    27
2    37
Name: age, dtype: int64

0    17
1    27
2    37
Name: age, dtype: int64

### Transformations After Groupby

* Returns a row for each row in the original DataFrame
* Can use group values like `mean` when applying the transformation
* It's applied on a single attribute

In [46]:
df = pd.DataFrame({'name':['Peter','Paul','Mary'],'department':['CS','ENG','CS'],'salary':[10,5,3],'age':[20,30,40]})
df['age'] = df.groupby('department')['age'].transform(lambda x: x - x.mean())
display(df)

    name department  salary  age
0  Peter         CS      10  -10
1   Paul        ENG       5    0
2   Mary         CS       3   10

### `apply` without Groupby

* Similar to `transform`, but you need to specify the axis
* Also applied on the whole row or column
* Returns a Series

In [47]:
df = pd.DataFrame({'name':['Peter','Paul','Mary'],'department':['CS','ENG','CS'],'salary':[10,5,3],'age':[20,30,40]})
display(df.apply(lambda x: x['age'] + 1, axis=1))

0    21
1    31
2    41
dtype: int64

### `apply` After Groupby

More general than `transform`, the function takes a row as input and returns a value

In [48]:
def myFunc(x):
    return x['salary'] + x['age'].mean() * .1

df = pd.DataFrame({'name':['Peter','Paul','Mary'],'department':['CS','ENG','CS'],'salary':[10,5,3],'age':[20,30,40]})
display(df.groupby('department').apply(myFunc))

department
CS          0    13.0
            2     6.0
ENG         1     8.0
Name: salary, dtype: float64

## Pivot Tables

In a pivot table, one can specify the attribute to analyze and the partioning by rows and columns

In [55]:
import seaborn as sns

titanic = sns.load_dataset('titanic') # Loads a .csv file via pandas.read_csv()
display(titanic)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [56]:
display(titanic.groupby(['sex','class'])['survived'].mean().unstack())
display(titanic.pivot_table('survived', index='sex', columns='class'))

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

General syntax:

`pivot_table(data, values, index, columns)`

`aggfunc = 'man', fill_values, margins=False, dropna=True, margins_name='All'`

In [57]:
display(titanic.pivot_table(index='sex',columns='class',aggfunc={'survived':'sum','fare':'mean'}))
display(titanic.pivot_table('survived', index='sex', columns='class', margins=True)) # adds the last 'All' row

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

### Fine-grained Pivot Table

To get additional info for each age range:

In [58]:
age = pd.cut(titanic['age'],[0,10,20,30,40,50,60])
display(titanic.pivot_table('survived', index=['sex',age], columns='class'))

class               First    Second     Third
sex    age
female (0, 10]   0.000000  1.000000  0.500000
       (10, 20]  1.000000  1.000000  0.520000
       (20, 30]  0.952381  0.892857  0.500000
       (30, 40]  1.000000  0.941176  0.428571
       (40, 50]  0.923077  0.900000  0.000000
       (50, 60]  1.000000  0.666667       NaN
male   (0, 10]   1.000000  1.000000  0.363636
       (10, 20]  0.400000  0.100000  0.129630
       (20, 30]  0.473684  0.000000  0.144330
       (30, 40]  0.520000  0.115385  0.142857
       (40, 50]  0.375000  0.111111  0.090909
       (50, 60]  0.285714  0.000000  0.000000

To get additional info for each age range and each fare range

In [59]:
age = pd.cut(titanic['age'],[0,10,20,30,40,50,60])
fare = pd.qcut(titanic['fare'],5)
display(titanic.pivot_table('survived', index=['sex',age], columns=[fare,'class']))

fare            (-0.001, 7.854]           (7.854, 10.5]            \
class                     First     Third        Second     Third
sex    age
female (0, 10]              NaN       NaN           NaN  0.000000
       (10, 20]             NaN  0.666667      1.000000  0.714286
       (20, 30]             NaN  0.777778      1.000000  0.200000
       (30, 40]             NaN  0.000000      1.000000  0.333333
       (40, 50]             NaN  0.000000      1.000000       NaN
       (50, 60]             NaN       NaN      0.000000       NaN
male   (0, 10]              NaN       NaN           NaN  1.000000
       (10, 20]             NaN  0.052632      0.333333  0.173913
       (20, 30]             NaN  0.186047      0.000000  0.100000
       (30, 40]             0.0  0.076923      0.000000  0.160000
       (40, 50]             NaN  0.000000           NaN  0.222222
       (50, 60]             NaN  0.000000           NaN  0.000000

fare            (10.5, 21.679]           (21.679, 39.688]                   \
class                   Second     Third            First Second     Third
sex    age
female (0, 10]             NaN  0.750000              NaN   1.00  0.222222
       (10, 20]       1.000000  0.285714         1.000000   1.00  0.000000
       (20, 30]       0.846154  0.636364         1.000000   0.90  0.000000
       (30, 40]       0.888889  0.666667              NaN   1.00  0.333333
       (40, 50]       1.000000  0.000000         0.800000   0.75  0.000000
       (50, 60]       1.000000       NaN         1.000000   1.00       NaN
male   (0, 10]        1.000000  0.857143              NaN   1.00  0.083333
       (10, 20]       0.000000  0.285714              NaN   0.00  0.000000
       (20, 30]       0.000000  0.100000         0.666667   0.00  0.000000
       (30, 40]       0.181818  0.000000         0.777778   0.10  0.000000
       (40, 50]       0.200000  0.000000         0.333333   0.00       NaN
       (50, 60]       0.000000       NaN         0.375000   0.00       NaN

fare            (39.688, 512.329]
class                       First Second Third
sex    age
female (0, 10]           0.000000    1.0   NaN
       (10, 20]          1.000000    NaN   0.0
       (20, 30]          0.950000    1.0   NaN
       (30, 40]          1.000000    NaN   NaN
       (40, 50]          1.000000    1.0   0.0
       (50, 60]          1.000000    NaN   NaN
male   (0, 10]           1.000000    NaN   0.0
       (10, 20]          0.400000    0.0   0.0
       (20, 30]          0.384615    0.0   0.5
       (30, 40]          0.500000    0.0   1.0
       (40, 50]          0.400000    NaN   NaN
       (50, 60]          0.166667    NaN   NaN

## `eval`

Optimized to run fast

In [60]:
df1 = pd.DataFrame([{'a':1,'b':2},{'a':2,'b':3}])
df2 = pd.DataFrame([{'a':2,'b':3},{'a':2,'b':4}])
display(pd.eval('df1 + df2'))
display(pd.eval('(df1 < df2) | (df1 == df2)'))
display(pd.eval('df1.a + df2.a'))
display(df1.eval('c = a + b'))
x = 3
display(df1.eval('c = a + @x'))

   a  b
0  3  5
1  4  7

      a     b
0  True  True
1  True  True

0    3
1    4
Name: a, dtype: int64

   a  b  c
0  1  2  3
1  2  3  5

   a  b  c
0  1  2  4
1  2  3  5

## Reading From Text Files

* Excel File: `df = pd.read_excel('stocks.xls', header=[0,1])`
    First 2 rows are headers
* Text file: `df = pd.read_csv('noc_regions.csv', delimiter='\t')`